In [1]:
import numpy as np
import pandas as pd
heroes = pd.read_csv("heroes_information.csv")

In [2]:
###instalar desde anaconda navigator######
from pandasql import *

In [3]:
pysqldf = lambda q: sqldf(q,globals())

In [4]:
query0 = " SELECT * FROM heroes limit 10"

In [5]:
pysqldf(query0)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0
5,5,Absorbing Man,Male,blue,Human,No Hair,193.0,Marvel Comics,None,bad,122.0
6,6,Adam Monroe,Male,blue,None,Blond,-99.0,NBC - Heroes,None,good,-99.0
7,7,Adam Strange,Male,blue,Human,Blond,185.0,DC Comics,None,good,88.0
8,8,Agent 13,Female,blue,None,Blond,173.0,Marvel Comics,None,good,61.0
9,9,Agent Bob,Male,brown,Human,Brown,178.0,Marvel Comics,None,good,81.0

In [6]:
# 1. Cuál es el nombre del primer superhéroe de la tabla heroes?
query1 = " SELECT name FROM heroes limit 1 "

In [7]:
pysqldf(query1)
# El nombre del primer superheroes de la tabla es A-bomb.

     name
0  A-Bomb

In [8]:
# 2. Cuántas casas publicadoras existen?
query2 = " SELECT COUNT(DISTINCT Publisher) AS Cant_Publicadores FROM heroes "

In [9]:
pysqldf(query2)
# Existen 24 casas publicadoras.

   Cant_Publicadores
0                 24

In [10]:
# 3. Cuántos superhéroes miden más de 2 metros (200 cms)
query3 = " SELECT COUNT(Height) FROM heroes WHERE Height > 200 "

In [11]:
pysqldf(query3)
# Hay 59 superhéroes que miden más de 2 metros.

   COUNT(Height)
0             59

In [12]:
# 4. Cuántos superhéroes son humanos y miden más de 2 metros (200 cms)?
query4 = " SELECT COUNT(*) FROM heroes WHERE Race = 'Human' AND Height > 200 "

In [13]:
pysqldf(query4)
# Existen únicamente 12 humanos que midan más de 2 metros.

   COUNT(*)
0        12

In [14]:
# 5. Cuántos superhéroes pesan más de 100 lbs y menos de 200 lbs?
query5 = " SELECT COUNT(Weight) FROM heroes WHERE Weight BETWEEN 100 AND 200"

In [15]:
pysqldf(query5)
# Hay 98 superhéroes que pesen entre 100 y 200 libras.

   COUNT(Weight)
0             98

In [18]:
# 6. Cuántos superhéroes tienen los ojos de color azul o rojo?
query6 = " SELECT COUNT(*) FROM heroes WHERE `Eye color` IN ('red', 'blue') "

In [19]:
pysqldf(query6)
# Hay 271 superhéroes que tienen hojos de color azul o rojo.

   COUNT(*)
0       271

In [20]:
# 7. Cuántos superhéroes son Human, Mutant y tienen el pelo color Verde o son Vampiros con pelo Negro.
query7 = " SELECT COUNT(*) FROM heroes WHERE (Race='Human' AND `Hair color` = 'Green') OR (Race = 'Mutant' AND `Hair color` = 'Green') OR (Race = 'Vampire' AND `Hair color`= 'Black') "

In [21]:
pysqldf(query7)
# Hay solo 5 superhéroes que sean humanos, mutantes y que tengan el pelo verde; o vampiros que tengan el pelo negro.

   COUNT(*)
0         5

In [22]:
# 8. Cuál es el nombre del primer superhéroe si ordeno la tabla por raza en orden descendente?
query8 = " SELECT name FROM heroes ORDER BY Race DESC limit 1"

In [23]:
pysqldf(query8)
# Si ordenamos la tabla por raza en orden descenddente, el nombre del primer superhéroe es Solomon Grundy.

             name
0  Solomon Grundy

In [24]:
# 9. Cuántos superhéroes son de género masculino y cuántas de género femenino?
query9 = " SELECT Gender,Count(*) FROM heroes GROUP BY Gender HAVING COUNT(gender) > 100 "

In [25]:
pysqldf(query9)
# Hay 200 superhéroes de género femenino y 505 de género masculino.

   Gender  Count(*)
0  Female       200
1    Male       505

In [26]:
# 10. Cuántas casas publicadoras tienen más de 15 superhéroes?
query10 = " SELECT Publisher, Count(Publisher) FROM heroes GROUP BY Publisher HAVING COUNT(*) > 15 "

In [27]:
pysqldf(query10)
# Hay cuatro casas publicadoras con maa2

           Publisher  Count(Publisher)
0          DC Comics               215
1  Dark Horse Comics                18
2      Marvel Comics               388
3       NBC - Heroes                19